HELLO = """
Привет, я SP Store bot!  
Напиши мне цену в ¥ и я рассчитаю стоимость заказа.  
  
Здесь ты можешь ознакомиться со всей нужной информацией и оформить заказ. 
 
По всем вопросам пишите @hdbrnx
"""

LINK_ERROR = """
Ошибка ссылки.
Для заполенения этого поля воспользуйтесь инструкцией!
"""

DELIVER_BUTTONS = ("🛩Экспресс доставка🛩", "🚚Обычная Доставка🚚", "Отменить заказ❌")


DELIVER_TABLE = {"🛩Экспресс доставка🛩": "Экспресс", "🚚Обычная Доставка🚚": "Дефолт"}

# DELIVER_TEXT = """
# Выберите способ доставки: 
 
# Обычная🚚:
# 900 ₽/кг 9-14 дней (с момента отправки со склада в Китае)
# Обувь👟 ≈ 1600₽/пара
# Одежда👕 ≈ 1200₽/шт

# Экспресс🛩: 
# 3000 ₽/кг 1-4 дня (с момента отправки со склада в Китае)

# *Теперь доставка оплачивается сразу
# """

DELIVER_TEXT = """
Выберите способ доставки: 
 
Обычная🚜: 
900 руб/кг 9-14 дней (с момента отправки со склада в Китае) 
 
Экспресс🏎: 
3000 ₽/кг 1-4 дня (с момента отправки со склада в Китае)
"""


NOTIFICATION_TEXT = """
🚨 УВАГА 🚨
КАКОЙ ОТ ДОЛБОЕБ ПО ИМЕНИ -  @{user}
ЗАКАЗАЛ ОЧЕРЕДНУЮ ПОЕБЕНЬ

[ссылка на таблицу](https://docs.google.com/spreadsheets/d/172GQNWe5ncmpejoaufUCQgP_3yL6p8YGR6-a3Zv2pBA/edit?usp=sharing)
"""
CONFIG_RESET = "Конфиг успешно сброшен"


LET_ME_PRICE = "Отправьте цену в юанях"

ACCEPT_ORDER_BUTTONS = ("Подтвердить заказ✅", "Отменить заказ❌")

STOP_ORDER_BUTTON = "Отменить оформление"

MAKE_ORDER = """
Отправьте ссылку на товар
"""

LET_ME_SIZE = "Введите размер"


ORDER_IS_STOPED = "Заказ отменен❌"

ADMIN_PANEL = """
Изменить конфиг

Правило:
если < (нижний порог)¥ то (цена*курс)+(нижний навар)
если от (нижний порог)¥ до (верхний порог) то (цена*курс)+(верхний навар)
если > (верхний порог) то (цена*курс)+ (процент)% от цены
"""

PRICE = """
{price}₽ + доставка

Обычная🚚:
900 ₽/кг 9-14 дней (с момента отправки со склада в Китае)
Обувь👟 ≈ 1600₽/пара
Одежда👕 ≈ 1200₽/шт

Экспресс🛩: 
3000 ₽/кг 1-4 дня (с момента отправки со склада в Китае)

*Теперь доставка оплачивается сразу
"""

CONFIG_EDITED = "Конфиг измнен"


LET_ME_VALUE = "Введи данные данные на изменение ({param})"

ERROR_INPUT = (
    """
Ошибка ввода

На главную 
/start
""",
    """
Ошибка ввода

На главную 
/admin
""",
)


ERROR_MONITOR_ORDER = """
Ошибка, трэк-номер который вы ввели не действителен.

По всем вопросам пишите @hdbrnx
"""


def ready_order(
    let_me_link: str,
    let_me_name: str,
    let_me_price_rub: str,
    let_me_size: str,
    let_me_delivery: str,
    **kwargs,
):

    return f"""
Заказ оформлен!

Реквизиты продавца: 89165956510 Сбербанк/Т-банк Александр Ш.
(После оплаты сообщите @hdbrnx)

Ссылка на товар : [{let_me_name}]({let_me_link})
Цена в рублях : {let_me_price_rub}₽
Размер : {let_me_size}
Доставка : {let_me_delivery}

"""


ACCEPTED_ORDER = """
Ваш заказ передан админу.

Трэк-номер вашего заказа: `{order_id}`.

По всем вопросам пишите @hdbrnx

"""

MONITOR_ORDER_START = """
Введите трэк-номер вашего заказа.
"""


def monitor_order_text(
    poizon_link,
    size,
    price_ru,
    poizon_name,
    delivery_mode,
    order_code,
    status: str,
    comment,
):

    status_dict = {
        "неоплачен": "🔴Не оплачен",
        "оплачен": "🟡Оплачен",
        "заказаннаpoizon": "🔵Заказан на poizon",
        "впутинаскладвкитае": "🟠В пути на склад в китае",
        "отправленвмоскву": "🟣Отправлен в Москву",
        "готовквыдаче": "🟢Готов к выдаче",
        "выдан": "⚫️Выдан",
    }
    print(status.lower().replace(" ", ""))
    return f"""
Заказ номер `{order_code}`

Ccылка на Poizon: [{poizon_link}]({poizon_name})
Размер: {size}
Режим доставки: {delivery_mode}
Цена к оплате: {price_ru}₽
Статус заказа: {status_dict[status.lower().replace(" ", "")]}

Комментарии от админа:
_{comment}_

По всем вопросам пишите @hdbrnx
"""


def edit_product(text: str):
    ans = []
    ans1 = []
    word_list = text.split()
    counter = 0
    while "http" not in word_list[counter]:
        counter += 1
    ans.append(word_list[counter])
    counter += 1
    while 127 > ord(word_list[counter][0]) > 0:
        ans1.append(word_list[counter])
        counter += 1
    return [ans[0], " ".join(ans1)]
